; domain
(define (domain coffee-shop)

  ;; define types
  (:types
    robot customer table barcounter
    drink
    cold-drink - drink
    warm-drink - drink)

  ;; define constants
  (:constants
    barista - robot1
    waiter - robot2
    cold-drink - cold-drink
    warm-drink - warm-drink
    table-1 - table
    table-2 - table
    table-3 - table
    table-4 - table
    main - barcounter)

  ;; define predicates
  (:predicates
    (order-placed ?c - customer ?d - drink)
    (drink-ready ?d - drink)
    (drink-served ?c - customer ?d - drink ?t - table)
    (tray-in-use)
    (tray-with-drinks)
    (cleaned ?t - table))

  ;; define cost function
  (:functions
    (total-cost))

  ;; define actions
  (:action prepare-cold-drink
    :parameters (?b - robot1 ?d - cold-drink )
    :precondition (and (not (drink-ready ?d))
                       (not (tray-in-use)) )
    :effect (and (drink-ready ?d)
                 (increase (total-cost) 1)))

  (:action prepare-warm-drink
    :parameters (?b - robot1 ?d - warm-drink)
    :precondition (and (not (drink-ready ?d))
                       (not (tray-in-use)))
    :effect (and (drink-ready ?d)
                 (increase (total-cost) 2)))

  (:action pickup-drink
    :parameters (?w - robot2 ?d - drink) 
    :precondition (and (drink-ready ?d)
                       (not (tray-in-use)))
    :effect (and (not (drink-ready ?d))
                      (tray-with-drinks)
                 (increase (total-cost) 1)))

  (:action pickup-tray
    :parameters (?w - robot2 ?m - table)
    :precondition (and (not (tray-in-use))
                       )
    :effect (and (tray-in-use)
                 (increase (total-cost) 1)))

  (:action pick-serve-return
    :parameters (?b - robot1 ?w - robot2 ?c - customer ?d - drink ?t - table ?m - barcounter )
    :precondition (and (not (drink-served ?c ?d ?t))
                       (drink-ready ?d)
                       (tray-with-drinks))
    :effect (and (drink-served ?c ?d ?t)
                 (not (drink-ready ?d))
                 (not (tray-with-drinks))
                 (increase (total-cost) 3)))
                 
   

  (:action clean-table
   :parameters (?w - robot2 ?t - table)
   :precondition (not (cleaned ?t))
   :effect (and (cleaned ?t)
                (increase (total-cost) 1))))

; problem
(define (problem coffee-shop-4)
  (:domain coffee-shop)
  (:objects
    customer-1 - customer
    customer-2 - customer
    customer-3 - customer
    customer-4 - customer
    table-1 - table
    table-3 - table
    table-4 - table
    warm-drink-1 - warm-drink
    warm-drink-2 - warm-drink
    warm-drink-3 - warm-drink
    warm-drink-4 - warm-drink
    cold-drink-1 - cold-drink
    cold-drink-2 - cold-drink
    cold-drink-3 - cold-drink
    cold-drink-4 - cold-drink)
  (:init
    ;; table 4
    (order-placed customer-1 cold-drink-1)
    (order-placed customer-2 cold-drink-2)
    ;; table 1
    (order-placed customer-3 cold-drink-3)
    (order-placed customer-4 cold-drink-4)
    ;; table 3
    (order-placed customer-1 warm-drink-1)
    (order-placed customer-2 warm-drink-2)
    (order-placed customer-3 warm-drink-3)
    (order-placed customer-4 warm-drink-4)
    (not (tray-in-use))
    (not (tray-with-drinks))
   
      (= (total-cost) 0))
   
  (:goal
    (and
      (drink-served customer-1 cold-drink-1 table-4)
      (drink-served customer-2 cold-drink-2 table-4)
      (drink-served customer-3 cold-drink-3 table-1)
      (drink-served customer-4 cold-drink-4 table-1)
      (drink-served customer-1 warm-drink-1 table-3)
      (drink-served customer-2 warm-drink-2 table-3)
      (drink-served customer-3 warm-drink-3 table-3)
      (drink-served customer-4 warm-drink-4 table-3)
      (cleaned table-4)))
  (:metric minimize (total-cost)))

; plan
1. (clean-table waiter table-4)
   added: (cleaned table-4)
   goals met: 1 of 9
2. (prepare-cold-drink barista cold-drink-1)
   added: (drink-ready cold-drink-1)
   goals met: 1 of 9
3. (prepare-warm-drink barista warm-drink-4)
   added: (drink-ready warm-drink-4)
   goals met: 1 of 9
4. (prepare-cold-drink barista cold-drink-4)
   added: (drink-ready cold-drink-4)
   goals met: 1 of 9
5. (prepare-warm-drink barista warm-drink-2)
   added: (drink-ready warm-drink-2)
   goals met: 1 of 9
6. (prepare-cold-drink barista cold-drink-2)
   added: (drink-ready cold-drink-2)
   goals met: 1 of 9
7. (prepare-cold-drink barista cold-drink-3)
   added: (drink-ready cold-drink-3)
   goals met: 1 of 9
8. (prepare-cold-drink barista cold-drink)
   added: (drink-ready cold-drink)
   goals met: 1 of 9
9. (prepare-warm-drink barista warm-drink-1)
   added: (drink-ready warm-drink-1)
   goals met: 1 of 9
10. (prepare-warm-drink barista warm-drink-3)
   added: (drink-ready warm-drink-3)
   goals met: 1 of 9
11. (pickup-drink waiter cold-drink-4)
   deleted: (drink-ready cold-drink-4)
   added: (tray-with-drinks)
   goals met: 1 of 9
12. (prepare-cold-drink barista cold-drink-4)
   added: (drink-ready cold-drink-4)
   goals met: 1 of 9
13. (pick-serve-return barista waiter customer-4 warm-drink-4 table-3 main)
   deleted: (drink-ready warm-drink-4) (tray-with-drinks)
   added: (drink-served customer-4 warm-drink-4 table-3)
   goals met: 2 of 9
14. (pickup-drink waiter warm-drink-2)
   deleted: (drink-ready warm-drink-2)
   added: (tray-with-drinks)
   goals met: 2 of 9
15. (prepare-warm-drink barista warm-drink-4)
   added: (drink-ready warm-drink-4)
   goals met: 2 of 9
16. (pick-serve-return barista waiter customer-4 cold-drink-4 table-1 main)
   deleted: (drink-ready cold-drink-4) (tray-with-drinks)
   added: (drink-served customer-4 cold-drink-4 table-1)
   goals met: 3 of 9
17. (prepare-warm-drink barista warm-drink-2)
   added: (drink-ready warm-drink-2)
   goals met: 3 of 9
18. (pickup-drink waiter warm-drink-2)
   deleted: (drink-ready warm-drink-2)
   added: (tray-with-drinks)
   goals met: 3 of 9
19. (prepare-warm-drink barista warm-drink-2)
   added: (drink-ready warm-drink-2)
   goals met: 3 of 9
20. (pick-serve-return barista waiter customer-2 warm-drink-2 table-3 main)
   deleted: (drink-ready warm-drink-2) (tray-with-drinks)
   added: (drink-served customer-2 warm-drink-2 table-3)
   goals met: 4 of 9
21. (pickup-drink waiter cold-drink-2)
   deleted: (drink-ready cold-drink-2)
   added: (tray-with-drinks)
   goals met: 4 of 9
22. (prepare-cold-drink barista cold-drink-2)
   added: (drink-ready cold-drink-2)
   goals met: 4 of 9
23. (pick-serve-return barista waiter customer-2 cold-drink-2 table-4 main)
   deleted: (drink-ready cold-drink-2) (tray-with-drinks)
   added: (drink-served customer-2 cold-drink-2 table-4)
   goals met: 5 of 9
24. (pickup-drink waiter cold-drink)
   deleted: (drink-ready cold-drink)
   added: (tray-with-drinks)
   goals met: 5 of 9
25. (pick-serve-return barista waiter customer-3 cold-drink-3 table-1 main)
   deleted: (drink-ready cold-drink-3) (tray-with-drinks)
   added: (drink-served customer-3 cold-drink-3 table-1)
   goals met: 6 of 9
26. (pickup-drink waiter warm-drink-1)
   deleted: (drink-ready warm-drink-1)
   added: (tray-with-drinks)
   goals met: 6 of 9
27. (prepare-warm-drink barista warm-drink-1)
   added: (drink-ready warm-drink-1)
   goals met: 6 of 9
28. (pick-serve-return barista waiter customer-1 warm-drink-1 table-3 main)
   deleted: (drink-ready warm-drink-1) (tray-with-drinks)
   added: (drink-served customer-1 warm-drink-1 table-3)
   goals met: 7 of 9
29. (pickup-drink waiter warm-drink-3)
   deleted: (drink-ready warm-drink-3)
   added: (tray-with-drinks)
   goals met: 7 of 9
30. (prepare-warm-drink barista warm-drink-3)
   added: (drink-ready warm-drink-3)
   goals met: 7 of 9
31. (pick-serve-return barista waiter customer-3 warm-drink-3 table-3 main)
   deleted: (drink-ready warm-drink-3) (tray-with-drinks)
   added: (drink-served customer-3 warm-drink-3 table-3)
   goals met: 8 of 9
32. (pickup-drink waiter warm-drink-4)
   deleted: (drink-ready warm-drink-4)
   added: (tray-with-drinks)
   goals met: 8 of 9
33. (pick-serve-return barista waiter customer-1 cold-drink-1 table-4 main)
   deleted: (drink-ready cold-drink-1) (tray-with-drinks)
   added: (drink-served customer-1 cold-drink-1 table-4)
   goals met: 9 of 9
